industry_map = {
  "HD현대중공업": {
    "종목코드": "329180",
    "산업명": ["조선", "중공업", "해양플랜트",  "조선기자재"],
    "관련기업": [
        ("한국조선해양", "009540"),
        ("삼성중공업", "010140"),
        ("현대미포조선", "010620"),
        ("대우조선해양", "042660")
    ]
    # 📈 24년 6월부터 12개월간 상승 추세
},
"한화에어로스페이스": {
    "종목코드": "012450",
    "산업명": ["방산", "우주항공", "방위산업"],
    "관련기업": [
        ("현대로템", "064350"),
        ("한화시스템", "272210"),
        ("LIG넥스원", "079550"),
        ("퍼스텍", "010820")
    ]
    # 📈 24년 6월부터 12개월간 상승 추세
},
"한미반도체": {
    "종목코드": "042700",
    "산업명": ["반도체장비", "비메모리", "AI반도체",  "테스트소켓",],
    "관련기업": [
        ("테스", "095610"),
        ("원익IPS", "240810"),
        ("이오테크닉스", "039030"),
        ("한양디지텍", "078350")
    ]
    # 📉 24년 6월~11월 하락 → 📈 12월 상승
}
,
"현대자동차": {
    "종목코드": "005380",
    "산업명": ["완성차", "모빌리티", "차량플랫폼"],
    "관련기업": [
        ("기아", "000270"),
        ("현대모비스", "012330"),
        ("현대위아", "011210"),
        ("쌍용차", "003620")
    ]
    # 📉 24년 6월부터 12개월간 하락 추세
},
"에코프로": {
    "종목코드": "086520",
    "산업명": ["2차전지", "양극재", "전기차소재", "배터리소재"],
    "관련기업": [
        ("포스코퓨처엠", "003670"),
        ("엘앤에프", "066970"),
        ("에코프로비엠", "247540"),
        ("나노신소재", "121600")
    ]
    # 📉 24년 6월부터 12개월간 하락 추세
},
    "미래에셋증권": {
        "종목코드": "006800",
        "산업명": ["금융", "증권", "자산운용", "투자"],
        "관련기업": [
            ("NH투자증권", "005940"),
            ("한국금융지주", "071050"),
            ("삼성증권", "016360"),
            ("키움증권", "039490"),
        ]
    },
# Proj. company
"성우하이텍": {
        "종목코드": "015750",
        "산업명": ["자동차부품", "자동차", "차체", "전기차", "OEM"],
        "관련기업": [
            ("넥센타이어", "002350"),
            ("DN오토모티브", "007340"),
            ("한국앤컴퍼니", "000240"),
            ("에스엘", "005850"),
        ]
    },
    "고려제강": {
        "종목코드": "002240",
        "산업명": ["철강", "강판", "특수강", "소재", "금속소재"],
        "관련기업": [
            ("풍산", "103140"),
            ("KG스틸", "016380"),
            ("동국제강", "001230"),
            ("세아제강", "306200"),
        ]
    },

    "셀바스헬스케어": {
        "종목코드": "208370",
        "산업명": ["헬스케어", "바이오", "의료기기", "재활의료", "건강관리"],
        "관련기업": [
            ("하이로닉", "149980"),
            ("알파녹스", "043100"),
            ("녹십자엠에스", "142280"),
            ("나이벡", "138610"),
        ]
    },
    "메카로": {
        "종목코드": "241770",
        "산업명": ["반도체", "소재부품", "장비", "반도체소재", "디스플레이소재"],
        "관련기업": [
            ("KX하이텍", "052900"),
            ("에스앤에스텍", "101490"),
            ("이엘씨", "041520"),
            ("디엔에프", "092070"),
        ]
    },
    "한선엔지니어링": {
        "종목코드": "452280",
        "산업명": ["금속가공", "기계부품", "기타제조", "공업설비"],
        "관련기업": [
            ("한국정밀기계", "101680"),
            ("케이에스피", "073010"),
            ("에이치케이", "044780"),
            ("모델솔루션", "417970")
        ]
    },
    "데브시스터즈": {
        "종목코드": "194480",
        "산업명": ["게임엔터테인먼트","게임",
        "모바일게임",
        "게임개발",
        "디지털엔터테인먼트",
        ],
         "관련기업": [("미투온", "201490"), 
                    ("조이시티", "067000"),
                     ("액토즈소프트", "052790"), 
                     ("위메이드플레이", "123420")]
    },

"동성화인텍": {
    "종목코드": "033500",
    "산업명": ["LNG", "보냉재", "단열재", "에너지저장장치"],
    "관련기업": [
        ("한국카본", "017960"),
        ("일진하이솔루스", "271940"),
        ("세진중공업", "075580"),
        ("성광벤드", "014620")
    ]
}

}

